# SketchFreeFormSet Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..RebarFailures..::..SketchFreeFormSet Property
BuiltInFailures..::..RebarFailures Class See Also
---
Sketching of a free form set produces only a single bar.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId SketchFreeFormSet { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property SketchFreeFormSet As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ SketchFreeFormSet {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..RebarFailures Class
Autodesk.Revit.DB Namespace